# IsGeneric Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandlerType..::..IsGeneric Method
StructuralConnectionHandlerType Class See Also
---
Checks if StructuralConnectionHandlerType is generic.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsGeneric()
```

Visual Basic
---
```text
Public Function IsGeneric As Boolean
```

Visual C++
---
```text
public:
bool IsGeneric()
```

# ### Return Value
True if StructuralConnectionHandlerType is generic.
# See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace